Revit 2027 API
AlignmentStationLabel.GetAlignmentStationLabels(Alignment) Method
 Returns all alignment station labels placed on the given alignment.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<AlignmentStationLabel> GetAlignmentStationLabels(
	Alignment alignment
)
Public Shared Function GetAlignmentStationLabels (
	alignment As Alignment
) As ICollection(Of AlignmentStationLabel)
public:
static ICollection<AlignmentStationLabel^>^ GetAlignmentStationLabels(
	Alignment^ alignment
)
static member GetAlignmentStationLabels :
        alignment : Alignment -> ICollection<AlignmentStationLabel>
Parameters
alignment Alignment
The alignment for which the labels are returned.
Return Value
ICollection<AlignmentStationLabel>
Remarks
 The resulting collection may contain both "individual" labels (created via Create(Alignment, View, AlignmentStationLabelOptions)) and "labels in set" (created via CreateSet(Alignment, View, AlignmentStationLabelSetOptions)). These labels have categories respectively OST_Alignments and OST_AlignmentStationLabelSets.
See Also
Reference
AlignmentStationLabel Class
GetAlignmentStationLabels Overload
Autodesk.Revit.DB.Infrastructure Namespace